app/controllers/pricelists_controller.rb

  def index
    if Pricelist.count > 0
---
SELECT "pricelists".* FROM "pricelists"
SELECT COUNT(*) FROM "pricelists"

  def buildPriceList
    json_file = File.read('hipstercoffee.json')
    pricelist = JSON.parse(json_file)
    pricelistAR = Pricelist.create(shopName: pricelist[0]["shopName"], address: pricelist[0]["address"], phone: pricelist[0]["phone"])
---
INSERT INTO "pricelists" ("shopName", "address", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["shopName", "The Coffee Connection"], ["address", "123 Lakeside Way"], ["phone", "16503600708"], ["created_at", "2015-07-15 13:21:39.957841"], ["updated_at", "2015-07-15 13:21:39.957841"]]
INSERT INTO "prices" ("item", "price", "pricelist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item", "Cafe Latte"], ["price", 4.75], ["pricelist_id", 3], ["created_at", "2015-07-15 13:21:40.069775"], ["updated_at", "2015-07-15 13:21:40.069775"]]

  def getMenu
    prices = Price.all
---
SELECT "prices".* FROM "prices"

  def generateReceipt
    #for testing fake json is created here rather than being passed in.
    #orderJ = params[:orderdata]
    orderJ = "[{ \"orderName\": \"Jane\",
                 \"tableNumber\": \"1\",
                 \"numberOfCustomers\": \"4\",
                 \"orderItems\":[{\"Cafe Latte\": 2,
                                  \"Blueberry Muffin\": 1

                }]
              }]"
    order = JSON.parse(orderJ)
    pricelist = Pricelist.first
---
SELECT  "pricelists".* FROM "pricelists"  ORDER BY "pricelists"."id" ASC LIMIT 1

  def amount
    orderJ = "[{ \"orderName\": \"Jane\",
                 \"tableNumber\": \"1\",
                 \"numberOfCustomers\": \"4\",
                 \"orderItems\":[{\"Cafe Latte\": 2,
                                  \"Blueberry Muffin\": 1

                }]
              }]"
    order = JSON.parse(orderJ)
    pricelist = Pricelist.first
---
SELECT  "pricelists".* FROM "pricelists"  ORDER BY "pricelists"."id" ASC LIMIT 1