app/controllers/pricelists_controller.rb

INSERT INTO "pricelists" ("shopName", "address", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["shopName", "The Coffee Connection"], ["address", "123 Lakeside Way"], ["phone", "16503600708"], ["created_at", "2015-07-13 18:54:17.639542"], ["updated_at", "2015-07-13 18:54:17.639542"]]
INSERT INTO "prices" ("item", "price", "pricelist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item", "Cafe Latte"], ["price", 4.75], ["pricelist_id", 1], ["created_at", "2015-07-14 17:29:53.666558"], ["updated_at", "2015-07-14 17:29:53.666558"]]
---
    def new
      json_file = File.read('hipstercoffee.json')
      pricelist = JSON.parse(json_file)
      pricelistAR = Pricelist.create(shopName: pricelist[0]["shopName"], address: pricelist[0]["address"], phone: pricelist[0]["phone"])